---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BuildingpadHeightabovelevelParam
source: html/cf194a72-af93-402c-7d26-8c589dce4776.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BuildingpadHeightabovelevelParam Property

"Height Offset From Level"

## Syntax (C#)
```csharp
public static ForgeTypeId BuildingpadHeightabovelevelParam { get; }
```